package com.example.myapplication

import androidx.appcompat.app.AppCompatActivity
import android.os.Bundle
import android.widget.Button
import android.widget.TextView
import android.widget.Toast
import kotlin.random.Random


class MainActivity : AppCompatActivity() {
    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_main)
        val textView : TextView= findViewById(R.id.fal)
        val infoButton : Button= findViewById(R.id.info)
        val dokmeButton : Button= findViewById(R.id.dokme)
        val listOfFals = listOf<String>("اَلا یا اَیُّهَا السّاقی اَدِرْ کَأسَاً و ناوِلْها\n" +
                "که عشق آسان نمود اوّل ولی افتاد مشکل\u200Cها\n" +
                "به بویِ نافه\u200Cای کآخر صبا زان طُرّه بگشاید\n" +
                "ز تابِ جَعدِ مشکینش چه خون افتاد در دل\u200Cها\n" +
                "مرا در منزلِ جانان چه امنِ عیش چون هر دَم\n" +
                "جَرَس فریاد می\u200Cدارد که بَربندید مَحمِل\u200Cها\n" +
                "به مِی سجّاده رنگین کن گَرت پیرِ مُغان گوید\n" +
                "که سالِک بی\u200Cخبر نَبوَد ز راه و رسمِ منزل\u200Cها\n" +
                "شبِ تاریک و بیمِ موج و گردابی چنین هایل\n" +
                "کجا دانند حالِ ما سبکبارانِ ساحل\u200Cها\n" +
                "همه کارم ز خودکامی به بدنامی کشید آخر\n" +
                "نهان کِی مانَد آن رازی کزو سازند محفل\u200Cها\n" +
                "حضوری گر همی\u200Cخواهی از او غایب مشو حافظ\n" +
                "مَتٰی ما تَلْقَ مَنْ تَهْویٰ دَعِ الدُّنْیا و اَهْمِلْها", "صلاحِ کار کجا و منِ خراب کجا\n" +
                "ببین تفاوتِ ره کز کجاست تا بکجا\n" +
                "\n" +
                "دلم ز صومعه بگرفت و خِرقِهٔ سالوس\n" +
                "کجاست دیرِ مُغان و شرابِ ناب کجا\n" +
                "\n" +
                "چه نسبت است به رندی صَلاح و تقوا را\n" +
                "سماعِ وعظ کجا، نغمهٔ رباب کجا\n" +
                "\n" +
                "ز رویِ دوست دلِ دشمنان چه دریابد\n" +
                "چراغِ مرده کجا، شمعِ آفتاب کجا\n" +
                "\n" +
                "چو کُحلِ بینشِ ما خاکِ آستانِ شماست\n" +
                "کجا رویم؟، بفرما، ازین جناب کجا\n" +
                "\n" +
                "مبین به سیبِ زَنَخدان که چاه در راه است\n" +
                "کجا همی\u200C روی ای دل بدین شتاب کجا\n" +
                "\n" +
                "بشد، که یاد خوشش باد، روزگارِ وصال\n" +
                "خود آن کرشمه کجا رفت و آن عِتاب کجا\n" +
                "\n" +
                "قرار و خواب ز حافظ طمع مدار ای دوست\n" +
                "قرار چیست؟ صبوری کدام و خواب کجا؟", "اگر آن تُرک شیرازی به دست آرد دل ما را\n" +
                "به خال هِندویَش بخشم سمرقند و بخارا را\n" +
                "\n" +
                "بده ساقی مِیِ باقی که در جنت نخواهی یافت\n" +
                "کنار آب رُکن آباد و گُلگَشت مُصَّلا را\n" +
                "\n" +
                "فَغان کاین لولیانِ شوخِ شیرین\u200Cکار شهرآشوب\n" +
                "چنان بردند صبر از دل که تُرکان خوان یغما را\n" +
                "\n" +
                "ز عشق ناتمام ما جمال یار مُستَغنی است\n" +
                "به آب و رنگ و خال و خط چه حاجت روی زیبا را؟\n" +
                "\n" +
                "من از آن حسن روزافزون که یوسف داشت دانستم\n" +
                "که عشق از پردهٔ عصمت برون آرد زلیخا را\n" +
                "\n" +
                "اگر دشنام فرمایی و گر نفرین، دعا گویم\n" +
                "جواب تلخ می\u200Cزیبد، لب لعل شکرخا را\n" +
                "\n" +
                "نصیحت گوش کن جانا که از جان دوست\u200Cتر دارند\n" +
                "جوانان سعادتمند پند پیر دانا را\n" +
                "\n" +
                "حدیث از مطرب و مِی گو و راز دَهر کمتر جو\n" +
                "که کس نگشود و نگشاید به حکمت این معما را\n" +
                "\n" +
                "غزل گفتی و دُر سفتی، بیا و خوش بخوان حافظ\n" +
                "که بر نظم تو افشاند فلک عِقد ثریا را", "صبا به لطف بگو آن غزال رعنا را\n" +
                "که سر به کوه و بیابان تو داده\u200Cای ما را\n" +
                "\n" +
                "شکرفروش که عمرش دراز باد چرا\n" +
                "تَفَقُّدی نکند طوطی شکرخا را\n" +
                "\n" +
                "غرور حُسنت اجازت مگر نداد ای گل؟\n" +
                "که پرسشی نکنی عَندَلیب شیدا را\n" +
                "\n" +
                "به خُلق و لطف توان کرد صید اهل نظر\n" +
                "به بند و دام نگیرند مرغ دانا را\n" +
                "\n" +
                "ندانم از چه سبب رنگ آشنایی نیست\n" +
                "سَهی\u200C قدانِ سیَه\u200C چشمِ ماه\u200C سیما را\n" +
                "\n" +
                "چو با حبیب نشینی و باده پیمایی\n" +
                "به یاد دار مُحِبّان بادپیما را\n" +
                "\n" +
                "جز این قَدَر نتوان گفت در جمال تو عیب\n" +
                "که وضع مِهر و وفا نیست روی زیبا را\n" +
                "\n" +
                "در آسمان نه عجب گر به گفتهٔ حافظ\n" +
                "سرود زُهره به رقص آورد مسیحا را", "دل می\u200Cرود ز دستم صاحب\u200Cدلان خدا را\n" +
                "دردا که راز پنهان خواهد شد آشکارا\n" +
                "\n" +
                "کشتی\u200Cشکستگانیم ای باد شُرطِه برخیز\n" +
                "باشد که باز بینم دیدار آشنا را\n" +
                "\n" +
                "ده\u200Cروزه مِهر گردون، افسانه است و افسون\n" +
                "نیکی به جای یاران فرصت شمار یارا\n" +
                "\n" +
                "در حلقهٔ گل\u200C و مُل خوش خواند دوش بلبل\n" +
                "هاتِ الصَّبُوحَ هُبّوا یا ایُّها السُکارا\n" +
                "\n" +
                "ای صاحب کرامت شکرانهٔ سلامت\n" +
                "روزی تَفَقُّدی کن درویش بی\u200Cنوا را\n" +
                "\n" +
                "آسایش دو گیتی تفسیر این دو حرف است\n" +
                "با دوستان مروت با دشمنان مدارا\n" +
                "\n" +
                "در کوی نیک\u200Cنامی ما را گذر ندادند\n" +
                "گر تو نمی\u200Cپسندی تغییر کن قضا را\n" +
                "\n" +
                "آن تلخ\u200Cوَش که صوفی ام\u200Cُّالخَبائِثَش خواند\n" +
                "اَشهی لَنا و اَحلی مِن قُبلَةِ العَذارا\n" +
                "\n" +
                "هنگام تنگ\u200Cدستی در عیش کوش و مستی\n" +
                "کاین کیمیای هستی قارون کُنَد گدا را\n" +
                "\n" +
                "سرکش مشو که چون شمع از غیرتت بسوزد\n" +
                "دلبر که در کف او موم است سنگ خارا\n" +
                "\n" +
                "آیینهٔ سکندر، جام می است بنگر\n" +
                "تا بر تو عرضه دارد احوال مُلک دارا\n" +
                "\n" +
                "خوبان پارسی\u200Cگو، بخشندگان عمرند\n" +
                "ساقی بده بشارت رندان پارسا را\n" +
                "\n" +
                "حافظ به خود نپوشید این خرقهٔ مِی\u200Cْآلود\n" +
                "ای شیخ پاک\u200Cدامن معذور دار ما را")
        dokmeButton.setOnClickListener{
            textView.setText(listOfFals.random())
        }
        infoButton.setOnClickListener{
            Toast.makeText(this, "version 1 of FalTime created by moujan :)", Toast.LENGTH_SHORT).show()
        }
    }
}